In [31]:
import pandas as pd
import numpy as np

In [2]:
#1-1

a = pd.Series([0.10, 0.83, 1.24, 0.05])
print(a)

0    0.10
1    0.83
2    1.24
3    0.05
dtype: float64

In [4]:
#1-2

print(a.values)

[0.1  0.83 1.24 0.05]

In [5]:
#1-3

print(a.index)

RangeIndex(start=0, stop=4, step=1)

In [6]:
#1-4

a[1] = 10
print(a)

0     0.10
1    10.00
2     1.24
3     0.05
dtype: float64

In [8]:
#2-1

b = pd.Series([0.10, 0.83, 1.24, 0.05], index = [0,1,2,3])
print(b)

0    0.10
1    0.83
2    1.24
3    0.05
dtype: float64

In [9]:
#2-2

b = pd.Series([0.10, 0.83, 1.24, 0.05], index = ['a','b','c','d'])
print(b)

a    0.10
b    0.83
c    1.24
d    0.05
dtype: float64

In [10]:
#2-3

b = pd.Series([0.10, 0.83, 1.24, 0.05], index = [5,2,3,6])
print(b)

5    0.10
2    0.83
3    1.24
6    0.05
dtype: float64

In [11]:
#2-4

b[2] = 10
print(b)

5     0.10
2    10.00
3     1.24
6     0.05
dtype: float64

In [12]:
#3-1

football_dict = {'Salah': 'Liverpool', 'Kante': 'Chelsea', 'Ronaldo': 'MU', 'Sterling': 'MC', 'Mane': 'Liverpool'}
print(football_dict)

{'Salah': 'Liverpool', 'Kante': 'Chelsea', 'Ronaldo': 'MU', 'Sterling': 'MC', 'Mane': 'Liverpool'}

In [20]:
#3-2

c = pd.Series(football_dict)
print(c)

Salah       Liverpool
Kante         Chelsea
Ronaldo            MU
Sterling           MC
Mane        Liverpool
dtype: object

In [14]:
#3-3

print(c[1:4])

Kante       Chelsea
Ronaldo          MU
Sterling         MC
dtype: object

In [16]:
#4

d = pd.Series(10, index = [1,2,3,4,5])
print(d)

1    10
2    10
3    10
4    10
5    10
dtype: int64

In [17]:
#5-1

fposition_dict = {'Salah': 'RW', 'Kante': 'CM', 'Ronaldo': 'FW', 'Sterling': 'RW', 'Mane': 'LW'}
print(fposition_dict)

{'Salah': 'RW', 'Kante': 'CM', 'Ronaldo': 'FW', 'Sterling': 'RW', 'Mane': 'LW'}

In [19]:
#5-2

e = pd.Series(fposition_dict)
print(c)

Salah       RW
Kante       CM
Ronaldo     FW
Sterling    RW
Mane        LW
dtype: object

In [28]:
#5-3

df = pd.DataFrame({'Club':c, 'Position':e})
df

               Club Position
Salah     Liverpool       RW
Kante       Chelsea       CM
Ronaldo          MU       FW
Sterling         MC       RW
Mane      Liverpool       LW

In [29]:
#5-4

df['Position'] = df['Position'].replace(['CM'], 'COD')
df

               Club Position
Salah     Liverpool       RW
Kante       Chelsea      COD
Ronaldo          MU       FW
Sterling         MC       RW
Mane      Liverpool       LW

In [33]:
#6-1

g = pd.Series([0.10, 0.83, np.nan, 1.24, None, 0.05])
print(g)

0    0.10
1    0.83
2     NaN
3    1.24
4     NaN
5    0.05
dtype: float64

In [34]:
#6-2

g.isnull()

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [35]:
#6-3

g[g.notnull()]

0    0.10
1    0.83
3    1.24
5    0.05
dtype: float64

In [36]:
#6-4

g.dropna()

0    0.10
1    0.83
3    1.24
5    0.05
dtype: float64

In [39]:
#6-5

g.fillna(0)

0    0.10
1    0.83
2    0.00
3    1.24
4    0.00
5    0.05
dtype: float64

In [41]:
#7-1

dfdf = pd.DataFrame([[2, 5, np.nan],[6, 7, 1], [3, None, 2]])
dfdf

   0    1    2
0  2  5.0  NaN
1  6  7.0  1.0
2  3  NaN  2.0

In [42]:
#7-2

dfdf.dropna()

   0    1    2
1  6  7.0  1.0

In [43]:
#7-3

dfdf.dropna(axis=1)

   0
0  2
1  6
2  3

In [48]:
#7-4

dfdf.fillna(method='ffill', axis=1)

     0    1    2
0  2.0  5.0  5.0
1  6.0  7.0  1.0
2  3.0  3.0  2.0

In [49]:
#7-5

dfdf.fillna(method='bfill', axis=1)

     0    1    2
0  2.0  5.0  NaN
1  6.0  7.0  1.0
2  3.0  2.0  2.0

In [50]:
#7-6

dfdf.fillna(method='ffill')

   0    1    2
0  2  5.0  NaN
1  6  7.0  1.0
2  3  7.0  2.0

In [51]:
#7-7

dfdf.fillna(method='bfill')

   0    1    2
0  2  5.0  1.0
1  6  7.0  1.0
2  3  NaN  2.0